Домашняя_работа/src/DataProcessors/УстановкаЦенПродажи/УстановкаЦенПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаЦенПродажи</name>
</mdclass:DataProcessor>

Домашняя_работа/src/InformationRegisters/ЦеныПродажиНоменклатура/ЦеныПродажиНоменклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатура</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Домашняя_работа/src/DataProcessors/УстановкаЦенПродажи/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Отбор = Новый Структура("Номенклатура", ВыбранноеЗначение);
	Найденные = СписокНоменклатуры.НайтиСтроки(Отбор);
	Если Найденные.Количество() = 0 Тогда
		НоваяСтрока = СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВариантУстановки();
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьЦенуНасервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуНасервере()
	ТаблицаЗначений = СписокНоменклатуры.Выгрузить();
	ВсяНоменклатура = Новый Массив;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		ДобавитьКНоменклатуре(Строка.Номенклатура, ВсяНоменклатура);
	КонецЦикла;
	
	Если ВариантУстановки = 0 Тогда
		УстановитьФиксированнуюЦенуНаСервере(ВсяНоменклатура);
	ИначеЕсли ВариантУстановки = 1 Тогда
		УдалитьЦеныНаСервере(ВсяНоменклатура);
	ИначеЕсли ВариантУстановки = 2 Тогда
		ПакетноеИзменениеЦенНаСервере(ВсяНоменклатура);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьКНоменклатуре(Номенклатура, ВсяНоменклатура)
	Если Номенклатура.ЭтоГруппа = Истина Тогда
		Выборка = Справочники.Номенклатура.Выбрать(Номенклатура);
		Пока Выборка.Следующий() Цикл
			ДобавитьКНоменклатуре(Выборка.Ссылка, ВсяНоменклатура);
		КонецЦикла;
	Иначе
		ВсяНоменклатура.Добавить(Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)
	УстановитьВариантУстановки();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВариантУстановки()
	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0);
	Элементы.ПроцентОтТекущейЦены.Доступность = (ВариантУстановки = 2);
КонецПроцедуры

&НаСервере
Процедура УстановитьФиксированнуюЦенуНаСервере(ВсяНоменклатура)
	Для Каждого Номенклатура Из ВсяНоменклатура Цикл
		МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатура.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Цена = ФиксированнаяЦена;
		МенеджерЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьЦеныНаСервере(ВсяНоменклатура)
	
	Для Каждого Номенклатура Из ВсяНоменклатура Цикл
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатура.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПакетноеИзменениеЦенНаСервере(ВсяНоменклатура) 
	
	Для Каждого Номенклатура Из ВсяНоменклатура Цикл
		ПоследняяЗапись = Новый Структура();
		ПоследняяЗапись.Вставить("Период", Дата(1, 1, 1));
		ПоследняяЗапись.Вставить("Цена");
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатура.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.Период > ПоследняяЗапись.Период Тогда
				ПоследняяЗапись.Период = Запись.Период;
				ПоследняяЗапись.Цена = Запись.Цена;
			КонецЕсли;
		КонецЦикла;
		Запись = НаборЗаписей.Добавить();
		Запись.Номенклатура = Номенклатура;
		Запись.Период = ТекущаяДата();
		Запись.Цена = ПоследняяЗапись.Цена + ПоследняяЗапись.Цена * ПроцентОтТекущейЦены / 100;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
